// Операція: 'number' + 3 + 3
// Опис: JavaScript спочатку поєднує строку 'number' з числом 3, отримуючи 'number3'
// Потім вона поєднує результат 'number3' з числом 3, отримуючи 'number33'
let result1 = 'number' + 3 + 3;
console.log(result1); // Результат: 'number33'

// Операція: null + 3
// Опис: null автоматично перетворюється в 0, тому що null не може бути додано до числа
// Таким чином, при додаванні null i 3, дасть в результаті 3
let result2 = null + 3;
console.log(result2); // Результат: 3

// Операція: 5 && "qwerty"
// Опис: Оператор && поверне значення другого операнду, якщо обидва операнди істинні
// У цьому випадку обидва операнди є істинними, тому результатом буде значення другого операнду, тобто "qwerty"
let result3 = 5 && "qwerty";
console.log(result3); // Результат: "qwerty"

// Операція: +'40' + +'2' + "hillel"
// Опис: Унарний оператор + перетворює стрічки у числа
// Таким чином, '40' перетвориться у число 40, а '2' у число 2
// Потім вони додаються, отримуючи 42
// Потім, це число об'єднується зі стрічкою "hillel", утворюючи рядок "42hillel"
let result4 = +'40' + +'2' + "hillel";
console.log(result4); // Результат: "42hillel"

// Операція: '10' - 5 === 6
// Опис: Стрічка '10' перетвориться у число 10
// Потім від числа 10 віднімається число 5, отримуючи 5
// Потім, JavaScript порівнює 5 з числом 6
// Так як 5 не дорівнює 6, результатом буде false
let result5 = '10' - 5 === 6;
console.log(result5); // Результат: false

// Операція: true + false
// Опис: У JavaScript true перетворюється у число 1, а false у число 0
// Таким чином, додавання 1 до 0 дає результат 1
let result6 = true + false;
console.log(result6); // Результат: 1

// Операція: '4px' - 3
// Опис: JavaScript намагається виконати арифметичну операцію мінус між значенням '4px' та числом 3
// Оскільки значення '4px' не може бути конвертована у число, результат буде NaN (Not a Number)
let result7 = '4px' - 3;
console.log(result7); // Результат: NaN

// Операція: '4' - 3
// Опис: значення '4' перетвориться у число 4
// Таким чином, вираз 4 - 3 дає результат 1
let result8 = '4' - 3;
console.log(result8); // Результат: 1

// Операція: '6' + 3 ** 0
// Опис: Спочатку обчислюється піднесення до степеня: 3 ** 0 = 1
// Потім число 1 додається до значення '6', яке перетворюється у 6, отримуючи '61'
let result9 = '6' + 3 ** 0;
console.log(result9); // Результат: '61'

// Операція: 12 / '6'
// Опис: Значення '6' перетвориться у число 6
// Операція ділення 12 на 6 дає результат 2
let result10 = 12 / '6';
console.log(result10); // Результат: 2

// Операція: '10' + (5 === 6)
// Опис: Вираз (5 === 6) поверне false
// Значення '10' об'єднається з false, перетворившись у рядок "false"
// Таким чином, результатом буде значення "10false"
let result11 = '10' + (5 === 6);
console.log(result11); // Результат: "10false"

// Операція: null == ''
// Опис: Значення '' перетвориться у false
// null також перетвориться у false
// Таким чином, результатом буде false, оскільки обидва операнди мають різні типи даних
let result12 = null == '';
console.log(result12); // Результат: false

// Операція: 3 ** (9 / 3)
// Опис: Спочатку обчислюється вираз у дужках: 9 / 3 = 3
// Потім обчислюється піднесення до степеня: 3 ** 3 = 27
let result13 = 3 ** (9 / 3);
console.log(result13); // Результат: 27

// Операція: !!'false' == !!'true'
// Опис: Обидва операнди !!'false' та !!'true' повертають true
// Таким чином, результатом буде true, оскільки обидва операнди мають однакові значення
let result14 = !!'false' == !!'true';
console.log(result14); // Результат: true

// Операція: 0 || '0' && 1
// Опис: Оператор && має вищий пріоритет за ||, тому він виконається першим
// '0' перетвориться у true
// Результат операції '0' && 1 буде 1
// 0 || 1 поверне 1, бо перший операнд false
let result15 = 0 || '0' && 1;
console.log(result15); // Результат: 1

// Операція: (+null == false) < 1
// Опис: null перетвориться у 0
// Вираз (+null == false) буде true, оскільки обидва операнди мають однакове значення
// true перетвориться у 1
// 1 < 1 поверне false, оскільки 1 не менше 1
let result16 = (+null == false) < 1;
console.log(result16); // Результат: false

// Операція: false && true || true
// Опис: Вираз false && true поверне false
// Вираз false || true поверне true
let result17 = false && true || true;
console.log(result17); // Результат: true

// Операція: false && (false || true)
// Опис: Вираз false || true поверне true
// Таким чином, false && true поверне false
let result18 = false && (false || true);
console.log(result18); // Результат: false

// Операція: (+null == false) < 1 ** 5
// Опис: Спочатку виконається піднесення до степеня: 1 ** 5 = 1
// null перетвориться у 0
// Вираз (+null == false) буде true, оскільки обидва операнди мають однакове значення
// true перетвориться у 1
// 1 < 1 поверне false, оскільки 1 не менше 1
let result19 = (+null == false) < 1 ** 5;
console.log(result19); // Результат: false
